
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>5.种子管理器 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="6shi-jian-xun-huan.html" />
    
    
    <link rel="prev" href="4chou-qu-qi/42tableevaluator.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    1. 快速入门
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2ji-ben-zu-jian.html">
            
                <a href="2ji-ben-zu-jian.html">
            
                    
                    2.基本组件
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="2ji-ben-zu-jian/processor.html">
            
                <a href="2ji-ben-zu-jian/processor.html">
            
                    
                    2.1 Processor
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="2ji-ben-zu-jian/22-pipline.html">
            
                <a href="2ji-ben-zu-jian/22-pipline.html">
            
                    
                    2.2 Pipline
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="2ji-ben-zu-jian/23-sessionpool.html">
            
                <a href="2ji-ben-zu-jian/23-sessionpool.html">
            
                    
                    2.3 SessionPool
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3pa-chong-kong-zhi.html">
            
                <a href="3pa-chong-kong-zhi.html">
            
                    
                    3.爬虫控制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4chou-qu-qi.html">
            
                <a href="4chou-qu-qi.html">
            
                    
                    4.抽取器
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="4chou-qu-qi/41sipsoup.html">
            
                <a href="4chou-qu-qi/41sipsoup.html">
            
                    
                    4.1SipSoup
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="4chou-qu-qi/42tableevaluator.html">
            
                <a href="4chou-qu-qi/42tableevaluator.html">
            
                    
                    4.2TableEvaluator
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="5zhong-zi-guan-li-qi.html">
            
                <a href="5zhong-zi-guan-li-qi.html">
            
                    
                    5.种子管理器
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6shi-jian-xun-huan.html">
            
                <a href="6shi-jian-xun-huan.html">
            
                    
                    6.事件循环
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.7.1" data-path="6shi-jian-xun-huan/61-eventloopgong-zuo-ji-zhi.html">
            
                <a href="6shi-jian-xun-huan/61-eventloopgong-zuo-ji-zhi.html">
            
                    
                    6.1 eventLoop工作机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.2" data-path="6shi-jian-xun-huan/62zi-dong-shi-jian.html">
            
                <a href="6shi-jian-xun-huan/62zi-dong-shi-jian.html">
            
                    
                    6.2 自动事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.3" data-path="6shi-jian-xun-huan/63delayevent.html">
            
                <a href="6shi-jian-xun-huan/63delayevent.html">
            
                    
                    6.3 延时事件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7.4" data-path="6shi-jian-xun-huan/64classScanner.html">
            
                <a href="6shi-jian-xun-huan/64classScanner.html">
            
                    
                    6.4 classScanner
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >5.种子管理器</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>seedManager&#x662F;schedular&#x7684;&#x89D2;&#x8272;&#xFF0C;VS&#x7684;seedManager&#x903B;&#x8F91;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;seedManager&#x7684;&#x539F;&#x7406;&#x3002;&#x6240;&#x4EE5;&#x4ECE;&#x672C;&#x7AE0;&#x8282;&#x5F00;&#x59CB;&#xFF0C;&#x6587;&#x6863;&#x8BB2;&#x8FF0;&#x8BBE;&#x8BA1;&#x76F8;&#x5173;&#xFF0C;&#x4E3A;VS&#x8FDB;&#x9636;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x3002;</p>
<p>seedManager&#x57FA;&#x4E8E;&#x4E24;&#x4E2A;&#x6838;&#x5FC3;&#x5DE5;&#x5177;&#xFF0C;&#x5206;&#x522B;&#x662F;bloomFilter&#x548C;berkleyDB&#xFF0C;bloomFilter&#x7528;&#x6765;&#x505A;&#x6D88;&#x91CD;&#xFF0C;berkleyDB&#x7528;&#x6765;&#x5B58;&#x50A8;&#x79CD;&#x5B50;&#x6570;&#x636E;&#xFF0C;berkleyDB&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4ED6;&#x548C;redis&#x4E00;&#x6837;&#x4E5F;&#x662F;key-value&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x5B9E;&#x6027;&#x80FD;&#x4F18;&#x4E8E;redis&#x3002;&#x76EE;&#x524D;VS&#x5BF9;berkleyDB&#x53EA;&#x80FD;&#x5B9E;&#x73B0;&#x5355;&#x8282;&#x70B9;&#xFF0C;&#x8FD0;&#x7528;berkleyDB&#x76EE;&#x7684;&#x662F;&#x5B9E;&#x73B0;&#x65AD;&#x70B9;&#x7EED;&#x722C;&#x548C;&#x544A;&#x8BC9;&#x5B58;&#x50A8;&#x3002; bloomFilter&#x6CA1;&#x5565;&#x53EF;&#x8BF4;&#x7684;&#xFF0C;&#x4ED6;&#x662F;hash&#x7684;&#x4E00;&#x79CD;&#x4F18;&#x5316;&#xFF0C;&#x901A;&#x8FC7;&#x727A;&#x7272;&#x51B2;&#x7A81;&#x57DF;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4EE5;&#x6781;&#x5C0F;&#x5BF9;&#x5185;&#x5B58;&#x4EE3;&#x4EF7;&#x5B9E;&#x73B0;&#x5E38;&#x6570;&#x7EA7;&#x522B;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x6D88;&#x91CD;&#x8BA1;&#x7B97;&#x3002;</p>
<p>seedManager&#x7684;&#x6574;&#x4F53;&#x7ED3;&#x6784;&#x5982;&#x4E0B;</p>
<p><img src="assets/seedManager.png" alt="&#x79CD;&#x5B50;&#x7BA1;&#x7406;&#x5668;"></p>
<h3 id="segment">segment</h3>
<p>&#x770B;&#x56FE;&#x8BF4;&#x8BDD;&#x5427;&#xFF0C;&#x4E00;&#x4E2A;&#x79CD;&#x5B50;&#x5982;&#x679C;&#x8981;&#x5165;&#x5E93;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5206;&#x6BB5;&#x8DEF;&#x7531;&#xFF0C;&#x5206;&#x6BB5;&#x7684;&#x76EE;&#x7684;&#x5E76;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x5E76;&#x53D1;&#x5F00;&#x9500;&#xFF0C;&#x800C;&#x662F;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x91CD;&#x590D;&#x6293;&#x53D6;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x4E00;&#x4E2A;URL&#xFF0C;&#x5728;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x6293;&#x53D6;&#xFF0C;&#x83B7;&#x53D6;&#x5230;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x67D0;&#x4E00;&#x4E2A;&#x5546;&#x54C1;&#x7684;&#x8BC4;&#x8BBA;&#xFF0C;&#x6BCF;&#x9694;&#x51E0;&#x5929;&#x5C31;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x8BC4;&#x8BBA;&#xFF0C;&#x4F46;&#x662F;&#x4E0A;&#x9762;&#x7684;URL&#x548C;&#x4E0A;&#x9762;&#x8BC4;&#x8BBA;&#x7684;URL&#x786E;&#x662F;&#x6CA1;&#x6709;&#x53D8;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x5B58;&#x5728;&#x589E;&#x91CF;&#x6293;&#x53D6;&#x7684;&#x9700;&#x6C42;&#x3002;&#x4F46;&#x662F;&#x722C;&#x866B;&#x6846;&#x67B6;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x53C8;&#x4E0D;&#x5141;&#x8BB8;&#x91CD;&#x590D;&#x6293;&#x53D6;&#xFF0C;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x72B6;&#x7ED3;&#x6784;&#xFF0C;&#x65B0;&#x7684;&#x5230;&#x7684;&#x79CD;&#x5B50;&#x53EF;&#x80FD;&#x521A;&#x521A;&#x5904;&#x7406;&#x8FC7;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x904D;&#x5386;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5C31;&#x91CD;&#x590D;&#x6293;&#x53D6;&#xFF0C;&#x90A3;&#x4E48;&#x722C;&#x866B;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x4E0D;&#x80FD;&#x7ED3;&#x675F;&#xFF0C;&#x4E3B;&#x8981;&#x7684;&#x662F;&#x4F1A;&#x5927;&#x91CF;&#x6D6A;&#x8D39;&#x673A;&#x5668;&#x8D44;&#x6E90;&#x3002;&#x9700;&#x6C42;&#x662F;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6D88;&#x91CD;&#xFF0C;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x53C8;&#x9700;&#x8981;&#x5B83;&#x4E0D;&#x6D88;&#x91CD;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;VS&#x5728;&#x8FD9;&#x91CC;&#x4E3A;&#x8FD9;&#x4E2A;&#x63D0;&#x4F9B;&#x4E86;&#x652F;&#x6301;&#xFF0C;&#x4ED6;&#x7684;&#x539F;&#x7406;&#x662F;&#x5728;&#x65F6;&#x95F4;&#x4E0A;&#x8FDB;&#x884C;&#x79CD;&#x5B50;&#x7A7A;&#x95F4;&#x5206;&#x7247;&#xFF0C;&#x4E24;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x79CD;&#x5B50;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x5728;&#x540C;&#x4E00;&#x4E2A;segment&#x4E2D;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x5141;&#x8BB8;&#x5728;&#x4E0D;&#x540C;segment&#x4E2D;&#x540C;&#x65F6;&#x51FA;&#x73B0;&#x3002;&#x76EE;&#x524D;segment&#x8BA1;&#x7B97;&#x662F;&#x57FA;&#x4E8E;&#x65F6;&#x95F4;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x53EA;&#x652F;&#x6301;&#x901A;&#x8FC7;&#x65F6;&#x95F4;&#x6765;&#x8FDB;&#x884C;&#x5206;&#x7247;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;segmentRoute&#x6765;&#x8BF4;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x5206;&#x7247;&#x7C92;&#x5EA6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E09;&#x5929;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x91CD;&#x590D;&#x6293;&#x53D6;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x5468;&#x6293;&#x4E00;&#x6B21;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x5B9A;&#x5236;&#x7684;&#x8BDD;&#xFF0C;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;<code>com.virjar.vscrawler.core.seed.SegmentResolver</code>,&#x690D;&#x5165;&#x5230;VSCrawlerBuilder&#x91CC;&#x9762;&#x5373;&#x53EF;&#x3002;&#x5177;&#x4F53;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x53C2;&#x8003; <code>com.virjar.vscrawler.core.seed.DefaultSegmentResolver</code>&#xFF0C;&#x9ED8;&#x8BA4;&#x6309;&#x5929;&#x5206;&#x6BB5;</p>
<h3 id="bloomfilter&#x8FC7;&#x6EE4;">bloomFilter&#x8FC7;&#x6EE4;</h3>
<p>&#x8DEF;&#x7531;&#x5230;segment&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x5F00;&#x59CB;&#x51C6;&#x5907;&#x52A0;&#x5165;&#x79CD;&#x5B50;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x9996;&#x5148;&#x8FC7;&#x4E00;&#x4E0B;bloomFilter&#xFF0C;&#x5982;&#x679C;bloomFilter&#x5224;&#x5B9A;&#x79CD;&#x5B50;&#x5DF2;&#x7ECF;&#x52A0;&#x5165;&#x8FC7;&#xFF0C;&#x90A3;&#x4E48;&#x65B0;&#x52A0;&#x5165;&#x7684;&#x79CD;&#x5B50;&#x5C06;&#x4F1A;&#x88AB;ignore&#x3002;&#x8FD9;&#x91CC;&#x53C8;&#x6D89;&#x53CA;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x5728;&#x79CD;&#x5B50;&#x6D88;&#x91CD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x600E;&#x4E48;&#x5224;&#x5B9A;&#x4E24;&#x4E2A;&#x79CD;&#x5B50;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;<code>http://www.virjar.com/resource.html</code>&#x548C;<code>http://www.virjar.com/resouce.html#test</code>&#x8FD9;&#x4E24;&#x4E2A;&#x94FE;&#x63A5;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x76F8;&#x5BF9;&#x4E8E;&#x7B2C;&#x4E00;&#x4E2A;URL&#x662F;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x5185;&#x90E8;&#x951A;&#x70B9;&#x800C;&#x5DF2;&#x3002;&#x6216;&#x8005;&#x4E24;&#x4E2A;URL&#xFF0C;&#x5E26;&#x6709;&#x4E24;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x4F46;&#x662F;URL&#x8BF7;&#x6C42;&#x5F97;&#x5230;&#x7684;&#x7F51;&#x9875;&#x4E5F;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x3002;&#x518D;&#x6216;&#x8005;jsonP&#x7684;&#x573A;&#x666F;&#xFF0C;jsonP&#x9ED8;&#x8BA4;&#x4F1A;&#x52A0;&#x4E00;&#x4E2A;callback&#x53C2;&#x6570;&#xFF0C;&#x4F46;&#x662F;callback&#x540E;&#x9762;&#x4F1A;&#x6709;&#x968F;&#x673A;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x670D;&#x52A1;&#x5668;&#x5E76;&#x4E0D;&#x5173;&#x5FC3;&#x8FD9;&#x4E2A;&#x5B57;&#x6BB5;&#xFF0C;&#x53EA;&#x662F;&#x539F;&#x6837;&#x8FD4;&#x56DE;&#x3002;VS&#x8003;&#x8651;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x4F9B;keyResolver&#x6269;&#x5C55;&#x70B9;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x63A5;&#x53E3;<code>com.virjar.vscrawler.core.seed.SeedKeyResolver</code>&#x5C31;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5B9E;&#x73B0;&#x6D88;&#x91CD;&#x89C4;&#x5219;&#x81EA;&#x5B9A;&#x4E49;&#x4E86;&#x3002;</p>
<h3 id="berkleydb">berkleyDB</h3>
<p>&#x79CD;&#x5B50;&#x6D88;&#x91CD;&#x8FC7;&#x6EE4;&#x901A;&#x8FC7;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x5F00;&#x59CB;&#x5165;&#x5E93;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F7F;&#x7528;keyResolver&#x5F97;&#x5230;&#x7684;key&#xFF0C;&#x6240;&#x4E3A;key&#xFF0C;seed&#x5BF9;&#x8C61;&#x4F5C;&#x4E3A;body&#xFF0C;&#x5B58;&#x50A8;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5373;&#x53EF;&#x3002;</p>
<h3 id="&#x79CD;&#x5B50;&#x5206;&#x53D1;">&#x79CD;&#x5B50;&#x5206;&#x53D1;</h3>
<p>&#x5BF9;&#x4E8E;seedManager&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x5206;&#x53D1;&#x79CD;&#x5B50;&#x4EFB;&#x52A1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5F00;&#x542F;&#x6570;&#x636E;&#x5E93;&#x6E38;&#x6807;&#xFF0C;&#x8FD9;&#x6837;db&#x53EF;&#x80FD;&#x968F;&#x65F6;&#x79FB;&#x52A8;&#x6E38;&#x6807;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x8C8C;&#x4F3C;&#x4F1A;&#x6709;&#x5E76;&#x53D1;&#x9519;&#x8BEF;&#xFF08;&#x611F;&#x89C9;&#x6211;&#x5BF9;berkleyDB&#x7684;&#x7528;&#x6CD5;&#x8FD8;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x719F;&#x6089;&#xFF0C;&#x54EA;&#x4F4D;&#x90A3;&#x5927;&#x795E;&#x80FD;&#x4E0D;&#x80FD;&#x5E2E;&#x5FD9;review&#x4E00;&#x4E0B;&#xFF09;&#x3002;&#x6240;&#x4EE5;seedManager&#x4F1A;&#x7F13;&#x5B58;&#x4E00;&#x90E8;&#x5206;&#x79CD;&#x5B50;&#x6570;&#x636E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5F53;&#x7F13;&#x5B58;&#x4E2D;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x6253;&#x5F00;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x52A0;&#x8F7D;&#x4E00;&#x6279;&#x6570;&#x636E;&#x5230;&#x5185;&#x5B58;&#x3002;&#x7136;&#x540E;&#x79CD;&#x5B50;&#x4EFB;&#x52A1;&#x8BF7;&#x6C42;&#x7684;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x5728;&#x5185;&#x5B58;&#x83B7;&#x53D6;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x6D89;&#x53CA;&#x5230;&#x6BB5;&#x8BA1;&#x7B97;&#xFF0C;&#x5206;&#x6BB5;&#x5BFC;&#x81F4;&#x5185;&#x5B58;load&#x7684;&#x903B;&#x8F91;&#x4E0D;&#x662F;&#x975E;&#x5E38;&#x6E05;&#x6670;&#x4E86;&#xFF0C;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x6BB5;&#x7D22;&#x5F15;&#x4F1A;&#x76F4;&#x63A5;&#x7EF4;&#x62A4;&#x5230;&#x5185;&#x5B58;&#xFF08;&#x6240;&#x4EE5;&#x4E0D;&#x5EFA;&#x8BAE;&#x5206;&#x6BB5;&#x7C92;&#x5EA6;&#x7279;&#x522B;&#x7EC6;&#xFF0C;&#x8981;&#x4E0D;&#x7136;&#x5185;&#x5B58;&#x53EF;&#x80FD;&#x8981;&#x7206;&#xFF1F;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x6BB5;&#x7D22;&#x5F15;&#x8FDB;&#x884C;&#x4E86;&#x6392;&#x5E8F;&#xFF0C;cacheload&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x79FB;&#x52A8;&#x6BB5;&#x7D22;&#x5F15;&#x6E38;&#x6807;&#xFF0C;&#x5E76;&#x4E14;&#x68C0;&#x67E5;&#x5F53;&#x524D;&#x6E38;&#x6807;&#x53D1;&#x751F;&#x65F6;&#x95F4;&#x7684;&#x662F;&#x5386;&#x53F2;&#x8282;&#x70B9;&#x8FD8;&#x662F;&#x672A;&#x6765;&#x8282;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x672A;&#x6765;&#xFF0C;&#x5219;&#x53D1;&#x9001;&#x5EF6;&#x65F6;&#x4E8B;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x7761;&#x7720;&#x7B49;&#x5F85;&#xFF0C;&#x7531;&#x4E8B;&#x4EF6;&#x5FAA;&#x73AF;&#x673A;&#x5236;&#x5728;&#x672A;&#x6765;&#x5524;&#x9192;&#x5F53;&#x524D;&#x7761;&#x7720;&#x7EBF;&#x7A0B;&#x3002;</p>
<h3 id="&#x79CD;&#x5B50;&#x72B6;&#x6001;&#x66F4;&#x65B0;">&#x79CD;&#x5B50;&#x72B6;&#x6001;&#x66F4;&#x65B0;</h3>
<p>&#x5373;&#x4F7F;&#x5206;&#x53D1;&#x4E86;&#x79CD;&#x5B50;&#xFF0C;&#x6570;&#x636E;&#x4E5F;&#x4E0D;&#x4F1A;&#x4ECE;seedManager&#x91CC;&#x9762;&#x5220;&#x9664;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x9664;&#x975E;&#x6536;&#x5230;&#x4E86;&#x79CD;&#x5B50;&#x5904;&#x7406;&#x5B8C;&#x6210;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x5426;&#x5219;&#x6570;&#x636E;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x53D8;&#x5316;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;VS&#x5728;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x79CD;&#x5B50;&#x7684;&#x5B8C;&#x6210;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x8C03;&#x7528;finish&#x65B9;&#x6CD5;&#x5F52;&#x8FD8;&#x79CD;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;seedManager&#x4F1A;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;&#x79CD;&#x5B50;&#x662F;&#x5426;&#x662F;&#x5904;&#x7406;&#x5B8C;&#x6210;&#xFF08;&#x4E0D;&#x7BA1;&#x662F;&#x6210;&#x529F;&#x8FD8;&#x662F;&#x5931;&#x8D25;&#xFF0C;&#x53EA;&#x8981;&#x5224;&#x5B9A;&#x5904;&#x7406;&#x5B8C;&#x6210;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x5904;&#x7406;&#x5B8C;&#x6210;&#xFF0C;&#x5219;&#x4F1A;&#x5BF9;&#x5176;&#x5F52;&#x6863;&#xFF0C;&#x5E76;&#x4E14;&#x4ECE;&#x5F85;&#x722C;&#x53BB;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x91CC;&#x9762;&#x5220;&#x9664;&#x3002;&#x5426;&#x5219;&#x4ECD;&#x7136;&#x4F1A;&#x653E;&#x5230;&#x5F85;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#x961F;&#x5217;&#x4E2D;</p>
<h3 id="&#x5410;&#x69FD;">&#x5410;&#x69FD;</h3>
<p>seedManager&#x91CC;&#x9762;&#xFF0C;&#x56E0;&#x4E3A;berkleyDB&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x633A;&#x591A;&#x52A0;&#x9501;&#x903B;&#x8F91;&#xFF0C;&#x611F;&#x89C9;&#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x6709;&#x70B9;&#x4E71;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="4chou-qu-qi/42tableevaluator.html" class="navigation navigation-prev " aria-label="Previous page: 4.2TableEvaluator">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="6shi-jian-xun-huan.html" class="navigation navigation-next " aria-label="Next page: 6.事件循环">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"5.种子管理器","level":"1.6","depth":1,"next":{"title":"6.事件循环","level":"1.7","depth":1,"path":"6shi-jian-xun-huan.md","ref":"6shi-jian-xun-huan.md","articles":[{"title":"6.1 eventLoop工作机制","level":"1.7.1","depth":2,"path":"6shi-jian-xun-huan/61-eventloopgong-zuo-ji-zhi.md","ref":"6shi-jian-xun-huan/61-eventloopgong-zuo-ji-zhi.md","articles":[]},{"title":"6.2 自动事件","level":"1.7.2","depth":2,"path":"6shi-jian-xun-huan/62zi-dong-shi-jian.md","ref":"6shi-jian-xun-huan/62zi-dong-shi-jian.md","articles":[]},{"title":"6.3 延时事件","level":"1.7.3","depth":2,"path":"6shi-jian-xun-huan/63delayevent.md","ref":"6shi-jian-xun-huan/63delayevent.md","articles":[]},{"title":"6.4 classScanner","level":"1.7.4","depth":2,"path":"6shi-jian-xun-huan/64classScanner.md","ref":"6shi-jian-xun-huan/64classScanner.md","articles":[]}]},"previous":{"title":"4.2TableEvaluator","level":"1.5.2","depth":2,"path":"4chou-qu-qi/42tableevaluator.md","ref":"4chou-qu-qi/42tableevaluator.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"5zhong-zi-guan-li-qi.md","mtime":"2017-06-25T01:37:28.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-06-25T14:04:12.299Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

